/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: ObjUpdate.h
** 创 建 人: 文小兵  
** 描    述: 对象更新集中到改源文件
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0  
** 创建日期: 2024年5月22日
**--------------------------------------------------------------------------------------
***************************************************************************************/

//保证以下所有内容只被同一源文件引用一次
#ifndef __ObjUpdate_h__
#define __ObjUpdate_h__

//确保仅在该文件编译时实例化一次对象
#ifdef  ObjUpdate_GLOBALS
    #define ObjUpdate_EXT
#else
    #define ObjUpdate_EXT  extern
#endif

//自定义引用
#include <stdbool.h>

//对象外部声明


//方法外部声明
ObjUpdate_EXT bool MC_Monitor(void);                                        //底盘控制数据对象监控更新


#endif

//***********************************END OF FILE***********************************


