/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: ACC_Init.h
** 创 建 人: 文小兵  
** 描    述: ACC对象实例化、初始化，整理汇总到此文件
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0  
** 创建日期: 2024年4月25日
**--------------------------------------------------------------------------------------
***************************************************************************************/

//保证以下所有内容只被同一源文件引用一次
#ifndef __ACC_Init_h__
#define __ACC_Init_h__

//确保仅在该文件编译时实例化一次对象
#ifdef  ACC_INIT_GLOBALS
    #define ACC_INIT_EXT
#else
    #define ACC_INIT_EXT  extern
#endif

//自定义引用	
#include "AgvChassisController.h"
#include "Para_Sys.h"

//对象外部声明
ACC_INIT_EXT ACC_DATA_TypeDef AccData;

//方法外部声明
ACC_INIT_EXT void ACC_ObjInit(ACC_DATA_TypeDef* p, ACC_Para_TypeDef* p2Para);

#endif

//***********************************END OF FILE***********************************


