/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: ACC_AsbCtrl_OnlyRemote.h
** 创 建 人: 文小兵
** 描    述: 仅遥控控制联动模块组织
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0
** 创建日期: 2025年7月22日
**--------------------------------------------------------------------------------------
***************************************************************************************/

//保证以下所有内容只被同一源文件引用一次
#ifndef __ACC_AsbCtrl_OnlyRemote_h__
#define __ACC_AsbCtrl_OnlyRemote_h__

//确保仅在该文件编译时实例化一次对象
#ifdef  ACC_AsbCtrl_OnlyRemote_GLOBALS
    #define ACC_AsbCtrl_OnlyRemote_EXT
#else
    #define ACC_AsbCtrl_OnlyRemote_EXT  extern
#endif

//自定义引用	
#include "basecalfunc.h"

//对象外部声明

//方法外部声明
ACC_AsbCtrl_OnlyRemote_EXT bool ACC_AssemlyCtrl_OnlyRemote(void);

#endif

//***********************************END OF FILE***********************************


