/****************************Copyright (c)**********************************************
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: Conf_User.h
** 创 建 人: 文小兵
** 描    述: 外部项目配置文件 该文件用于核心代码之外通过系统接口配置相关内容 但是与其它项目配置文件不同 该文件不和具体某个项目绑定
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0
** 创建日期: 2025年8月12日
**--------------------------------------------------------------------------------------
***************************************************************************************/

//保证以下所有内容只被同一源文件引用一次
#ifndef __Conf_User_h__
#define __Conf_User_h__

//确保仅在该文件编译时实例化一次对象
#ifdef Conf_User_GLOBALS
#define Conf_User_EXT
#else
#define Conf_User_EXT  extern
#endif

//自定义引用	
#include <stdbool.h>
#include "common_def.h"
//#include "AgvChassisController.h"

//项目设备编号定义
//注意这个定义在项目中要根据自己项目的EqpID进行修改，但是不必吸收到std
typedef enum
{
	//以下三个设计暂时没有使用
	EqpID_MDKSimulator = 00000,								//纯软仿真
	EqpID_BareSimulat = 00001,								//裸板仿真
	EqpID_HardwareSimulat = 00002,							//硬件仿真
	EqpID_Template = 00003,									//项目配置模板
	
	/*项目定义
	EqpID_46501 = 46501,									//465项目A车
	EqpID_46502 = 46502,									//465项目B车
	*/
	EqpID_End = 65536,										//int
}ACC_EqpID_EnumDef;

//对象外部声明

//方法外部声明
bool ParaInit_p2FucInit(ACC_EqpID_EnumDef EqpID);
bool Run_Init_User(void);

#endif
//***********************************END OF FILE***********************************


