/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: Conf_414.c
** 创 建 人: 文小兵  
** 描    述: 414项目超低车 交流供电 特殊舵轮和下降逻辑
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0  
** 创建日期:  2024年9月7日
**--------------------------------------------------------------------------------------
***************************************************************************************/

//保证以下所有内容只被同一源文件引用一次
#ifndef __Conf_TEST_h__
#define __Conf_TEST_h__

//确保仅在该文件编译时实例化一次对象
#ifdef  Conf_TEST_GLOBALS
    #define Conf_TEST_EXT
#else
    #define Conf_TEST_EXT  extern
#endif

//自定义引用
#include <stdbool.h>

//对象外部声明
//Conf_392_EXT ADDA_ADCNs_StDef g_ADCNs;                          //AD接口组


//方法外部声明
bool ParaInit_CodeReconf(void);

#endif

//***********************************END OF FILE***********************************


