/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: ACC_ModeSwitch.h
** 创 建 人: Master
** 描    述: 
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0  
** 创建日期: 2025年4月22日
**--------------------------------------------------------------------------------------
***************************************************************************************/  

//保证以下所有内容只被同一源文件引用一次
#ifndef __ACC_ModeSwitch_h__
#define __ACC_ModeSwitch_h__

//控制对象实例化只被指定文件编译时实例化一次
#ifdef  ACC_ModeSwitch_GLOBALS
	#define ACC_ModeSwitch_EXT
#else
	#define ACC_ModeSwitch_EXT  extern
#endif

#include "ACC_Project.h"

ACC_ModeSwitch_EXT void ACC_ModeSwitch_Process(ACC_DATA_TypeDef *p);
#endif

//***********************************END OF FILE***********************************
