/****************************Copyright (c)**********************************************                                       
**					╭--------------------------╮
**					︱	成都航发机器人有限公司	︱
**					︱	http://www.hangfa.com	︱                     
**					╰--------------------------╯
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: ACC_ServoEnCtrl.h
** 创 建 人: Master
** 描    述: 
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0  
** 创建日期: 2025年4月22日
**--------------------------------------------------------------------------------------
***************************************************************************************/  

//保证以下所有内容只被同一源文件引用一次
#ifndef __ACC_ServoEnCtrl_h__
#define __ACC_ServoEnCtrl_h__

//控制对象实例化只被指定文件编译时实例化一次
#ifdef  ACC_ServoEnCtrl_GLOBALS
	#define ACC_ServoEnCtrl_EXT
#else
	#define ACC_ServoEnCtrl_EXT  extern
#endif

ACC_ServoEnCtrl_EXT	void ACC_ServoEnCtrl(void);
#endif

//***********************************END OF FILE***********************************
