/****************************Copyright (c)**********************************************
**				┌--------------------------┐
**				│	成都航发控制工程有限公司	│
**				│	http://www.hangfa.com	│
**				└--------------------------┘
**------------- 文件信息 ---------------------------------------------------------------
** 文 件 名: drv_servo_gd32h7.c
** 创 建 者: 文小兵
** 功    能: GD32H7 CanOpen伺服驱动器全局变量定义
**           - 伺服数据数组 SVO[]
**           - 系统毫秒计数器 g_Sys_1ms_Counter
**           - LED调试计数器 g_CanFestival_led_cnt
** 说    明: g_Sys_1ms_Counter 由 SysTick 中断每1ms自增一次
**           用户需在SysTick_Handler中调用: g_Sys_1ms_Counter++;
**------------- 版本信息 ---------------------------------------------------------------
** 版    本: V1.0.0
** 创建时间: 2025年
**--------------------------------------------------------------------------------------
***************************************************************************************/

#define DRV_SERVO_GD32H7_GLOBALS
#include "drv_servo_gd32h7.h"
#include <string.h>

/* 伺服驱动器数据数组 */
SVO_DATA_TypeDef SVO[MAX_NodeId_NUM];

/* 系统毫秒计数器（需在SysTick中断中每1ms自增一次） */
volatile u32 g_Sys_1ms_Counter = 0U;

/* CanFestival LED调试计数器 */
volatile u32 g_CanFestival_led_cnt = 0U;

/************************************END OF FILE************************************/
