/**********************************************************************************************************
*
* 模块名称 : LED指示灯驱动模块
* 文件名称 : drv_led.c
* 版    本 : V1.0
* 说    明 : 驱动LED指示灯

**********************************************************************************************************/

#define		LED_GLOBALS



/* Includes ------------------------------------------------------------------*/
#include "includes.h"

#include "..\..\Drivers\inc\drv_led.h"





/* Private typedef -----------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

GPIO_TypeDef    *LED_PORT[LEDMAXCNT]	= {GPIO_PORT_LED1, GPIO_PORT_LED2, GPIO_PORT_LED3 };
const u32    		LED_PIN[LEDMAXCNT]    = {GPIO_PIN_LED1,  GPIO_PIN_LED2,  GPIO_PIN_LED3 };



/**********************************************************************************************************
* 函 数 名: Led_InitHard
* 功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
* 形    参:  无
* 返 回 值: 无
**********************************************************************************************************/
void Led_InitHard(void)
{
	GPIO_InitTypeDef GPIO_IS;

	/* 打开GPIO时钟 */
	RCC_AHB1PeriphClockCmd(RCC_ALL_LED, ENABLE);

	GPIO_IS.GPIO_Mode = GPIO_Mode_OUT;  /* 设为输出口 */
	GPIO_IS.GPIO_OType = GPIO_OType_PP;  /* 设为推挽模式 */
	GPIO_IS.GPIO_PuPd = GPIO_PuPd_NOPULL; /* 上下拉电阻不使能 */
	GPIO_IS.GPIO_Speed = GPIO_Speed_2MHz; /* IO口最大速度 */

	GPIO_IS.GPIO_Pin = GPIO_PIN_LED1;
	GPIO_Init(GPIO_PORT_LED1, &GPIO_IS);

	GPIO_IS.GPIO_Pin = GPIO_PIN_LED2;
	GPIO_Init(GPIO_PORT_LED2, &GPIO_IS);

	GPIO_IS.GPIO_Pin = GPIO_PIN_LED3;
	GPIO_Init(GPIO_PORT_LED3, &GPIO_IS);

	bsp_LedOff(LED1);//led1,灭"1"
	bsp_LedOff(LED2);//led2,灭"1"
	bsp_LedOff(LED3);//led3,灭"1"
 
}

/**********************************************************************************************************
* 函 数 名: bsp_LedOn
* 功能说明: 点亮指定的LED指示灯。
* 形    参:  _no : 指示灯序号
* 返 回 值: 无
**********************************************************************************************************/
void bsp_LedOn(LED_ID LEDx)
{
 LED_PORT[LEDx]->BSRRH=LED_PIN[LEDx];
}

/**********************************************************************************************************
* 函 数 名: bsp_LedOff
* 功能说明: 熄灭指定的LED指示灯。
* 形    参:  _no : 指示灯序号
* 返 回 值: 无
**********************************************************************************************************/
void bsp_LedOff(LED_ID LEDx)
{
 LED_PORT[LEDx]->BSRRL=LED_PIN[LEDx];
}

/**********************************************************************************************************
* 函 数 名: bsp_LedToggle
* 功能说明: 翻转指定的LED指示灯。
* 形    参:  _no : 指示灯序号，范围 1 - 4
* 返 回 值: 按键代码
**********************************************************************************************************/
void bsp_LedToggle(LED_ID LEDx)
{
 LED_PORT[LEDx]->ODR^=LED_PIN[LEDx];
}

/**********************************************************************************************************
* 函 数 名: bsp_IsLedOn
* 功能说明: 判断LED指示灯是否已经点亮。
* 形    参:  _no : 指示灯序号，范围 1 - 4
* 返 回 值: 1表示已经点亮，0表示未点亮
**********************************************************************************************************/
u8 bsp_IsLedOn(LED_ID LEDx)
{
 if ((LED_PORT[LEDx]->ODR & LED_PIN[LEDx]) != 0)
 {
  return 1;
 }
 return 0;
}

/***************************** hangfa (END OF FILE) *********************************/
