
#ifndef __COMMON_H
#define __COMMON_H			   

/*常用到的一些函数集合*/

extern u16 crc16(u8 *ptr, u16 len);

extern const u8 ascii_tab[16];
extern const u8 segd_tab[16];
	 
//滑动平均函数
typedef struct 
{
	u16 mis;	// 尾数
	s16 val;	// 平均后的值
}ST_S16_SLIDE_AVE, *pST_S16_SLIDE_AVE;

typedef struct 
{
	u16 mis;	// 尾数
	u16 val;	// 平均后的值
}ST_U16_SLIDE_AVE, *pST_U16_SLIDE_AVE;
										
/***************************************************************************************
* 名称：Modbus_CRC()
* 功能：Modbus的CRC16校验
* 入口参数1：puchMsg 校验的数据
* 入口参数2：usDataLen 数据的长度
* 出口参数 ：校验结果
***************************************************************************************/
extern u16 Modbus_CRC(u8 *puchMsg, u32 usDataLen);
#define  ModBus_CRC(a,b)	Modbus_CRC(a,b)				
			 
/***************************************************************************************
** 函数名称: ow_crc8
** 功能描述: 一线通讯模块的CRC8校验	 
** 参    数: p		/ 数据指针
** 参    数: n		/ 数据长度
** 返 回 值: CRC结果     
***************************************************************************************/		 
extern u8 ow_crc8(u8 *p, u32 n);  

/***************************************************************************************
* 函数名称：Chk_Sum()
* 功能描述：计算8位累积和校验值	
* 参    数：puchMsg 	/ 校验的数据
* 参    数：usDataLen	/ 数据的长度
* 返 回 值：校验结果
***************************************************************************************/
extern u8 Chk_Sum(u8 *puchMsg, u16 usDataLen);

/***************************************************************************************
** 函数名称: sqrt_16
** 功能描述: 开根号处理 
** 参    数: M		/ 32位源数据
** 返 回 值: 16位平方根
***************************************************************************************/
extern u16 sqrt_u16(u32 M);	

/***************************************************************************************
** 函数名称: sqrt_f32
** 功能描述: 浮点开方
** 参    数: num	/ 32位浮点数
** 返 回 值: 32位浮点数
***************************************************************************************/
extern fp32 sqrt_f32(fp32 number); 	

/***************************************************************************************
** 函数名称: f32toi32
** 功能描述: 32位浮点数转换为32位有符号整数
** 参    数: num	/ 32位浮点数
** 返 回 值: 返回32位有符号整数 
***************************************************************************************/
extern s32 f32toi32(fp32 in);

/***************************************************************************************
** 函数名称: f32toi16
** 功能描述: 32位浮点数转换为16位有符号整数
** 参    数: in	/ 32位浮点数
** 返 回 值: 返回16位有符号整数 
***************************************************************************************/
extern s16 f32toi16(fp32 in);	

/***************************************************************************************
** 函数名称: E2toE10
** 功能描述: 浮点二进制转浮点十进制
** 参    数: 浮点二进制
** 返 回 值: 浮点十进制
***************************************************************************************/
extern u32 E2toE10(fp32 in);

/***************************************************************************************
** 函数名称: E10toE2
** 功能描述: 浮点十进制转浮点二进制
** 参    数: 浮点十进制
** 返 回 值: 浮点二进制
***************************************************************************************/
extern fp32 E10toE2(u32 in);   

/***************************************************************************************
** 函数名称: BINtoBCD_16
** 功能描述: 十六位BIN转BCD
** 参    数: BIN输入
** 返 回 值: BCD输出
***************************************************************************************/
extern u16 BINtoBCD_16(u16 in);	  

/***************************************************************************************
** 函数名称: BINtoBCD_32
** 功能描述: 三十二位BIN转BCD
** 参    数: BIN输入
** 返 回 值: BCD输出
***************************************************************************************/
extern u32 BINtoBCD_32(u32 in);
		   
/***************************************************************************************
** 函数名称: BCDtoBIN_16
** 功能描述: 三十二位BCD转BIN
** 参    数: BCD输入
** 返 回 值: BIN输出
***************************************************************************************/
extern u16 BCDtoBIN_16(u16 in);	  

/***************************************************************************************
** 函数名称: BCDtoBIN_32
** 功能描述: 三十二位BCD转BIN
** 参    数: BCD输入
** 返 回 值: BIN输出
***************************************************************************************/
extern u32 BCDtoBIN_32(u32 in);

/***************************************************************************************
** 函数名称: Deley_1us
** 功能描述: 延时函数(1us)
** 参    数: in	/ 延时时间(us)
** 返 回 值: 无  
***************************************************************************************/
extern void Deley_1us(vu32 nCount);
 
/***************************************************************************************
** 函数名称: BtoG/GtoB
** 功能描述: 葛莱码转换
***************************************************************************************/
extern s32 BtoG(u32 lValue);					   
extern s32 GtoB(u32 lValue);	  

/***************************************************************************************
** 函数名称: Delay
** 功能描述: 延时函数
** 参    数: us		/ 延时周期数
** 返 回 值: None  
***************************************************************************************
extern void Delay(vu32 us);			*******/   

/***************************************************************************************
** 函数名称: Opr_Pin
** 功能描述: 操作引脚: 设置引脚为上拉输入 / 获取输入值
** 参    数: p		/ 引脚数组
** 参    数: len	/ 引脚数量
** 参    数: mode	/ 操作模式:0=配置;1=读取
** 返 回 值: None 
***************************************************************************************/
extern u32 Opr_Pin(vu32* p, u32 len, u8 mode);	 

/***************************************************************************************
** 函数名称: calc_sum16
** 功能描述: 计算16位ChkSum,原始参数ADD_SUM为0x5a,XOR_SUM为0xa5
** 参    数: p		/ 数据指针
** 参    数: n		/ 数据长度
** 返 回 值: 返回高8位为ADD_SUM,低8位为XOR_SUM    
***************************************************************************************/
extern u16 calc_sum16(u8 *p,u16 n);	   

typedef enum
{
	SCALE_L0 = 0,	
	SCALE_L1,
	SCALE_L2,
	SCALE_L3,
	SCALE_L4,
	SCALE_L5,
	SCALE_L6,
	SCALE_L7,
	SCALE_L8,
	SCALE_L9,
	SCALE_L10,
	SCALE_L11,
	SCALE_L12,
	SCALE_L13,
	SCALE_L14,
	SCALE_L15,
	TSK_Scheduling_NUM = 16,
}BIN_ATT_SCALE_Typedef;
/***************************************************************************************
** 函数名称: bin_att
** 功能描述: 对*p进行2进制调度计算,
** 参    数: p		/ 数据指针
** 返 回 值: 返回调度号0-32      
***************************************************************************************/
extern BIN_ATT_SCALE_Typedef bin_att(vu32 *p);

/***************************************************************************************
** 函数名称: s16_ave
** 功能描述: 计算16位数的平均值
** 参    数: val	/ 新值
** 参    数: p		/ 缓冲区地址
** 参    数: pe		/ 指针地址
** 参    数: n		/ 缓冲区元件个数(不是字节数)
** 返 回 值: 返回值经过4舍5入 
***************************************************************************************/
extern s16 s16_ave(s16 val,s16 *p ,u16 *pe,u16 n);					// 有符号平均  
extern u16 u16_ave(u16 val,u16 *p ,u16 *pe,u16 n);					// 无符号平均 
	   
/***************************************************************************************
** 函数名称: s16_slide_ave
** 功能描述: 计算16位数的滑动平均值,K越大滤波效果越差
** 参    数: val	/ 新值
** 参    数: p		/ 滑动平均结构体指针
** 参    数: k		/ 缓冲区元件个数(不是字节数)
** 返 回 值: 返回值经过4舍5入 
***************************************************************************************/
extern s16 s16_slide_ave(s16 val, pST_S16_SLIDE_AVE p, u8 k);		// 有符号数滑动平均	 
extern u16 u16_slide_ave(u16 val, pST_U16_SLIDE_AVE p, u8 k);		// 无符号数滑动平均	 
extern double double_slide_ave(double val, double *val_ave, u8 k);	// 浮点数滑动平均 

#define		SlidFilter_NUM		4

extern float SlidFilter(u16 *pBuf, u16 idata);

/***************************************************************************************
** 函数名称: Ask_pow_Constant
** 功能描述: 求幂函数的常量a---y=x^a(a为常数）底数为自变量幂为因变量,指数为常量的函数称为幂函数
** 参    数: 
				y :为幂函数
				x :	底数
** 返 回 值: a     
***************************************************************************************/
extern u8 Ask_pow_Constant(u16 y, u8 x);

/***************************************************************************************
** 函数名称: Complement_to_Former_Code
** 功能描述: 将负数的补码转换成原码
** 参    数: 
							x_data:输入的实体型负数
** 返 回 值: 	o_data : x_data的原码   
***************************************************************************************/
extern s8 Cmt_to_Frm_Code(s8 x_data);

/***************************************************************************************
** 函数名称: GPIO_CTRL
** 功能描述: GPIO输出状态控制
参数:0:置"0";1:置"1"
***************************************************************************************/
extern void GPIO_CTRL(GPIO_TypeDef* GPIOx, u16 GPIO_Pin, FlagStatus sta);

/***************************************************************************************
** 函数名称: Func_Idle
** 功能描述: 空闲函数,不进行任何操作.
** 参    数: None
** 返 回 值: None      
***************************************************************************************/
extern void Func_Idle(void);					   



//以下为汇编函数
void WFI_SET(void);		//执行WFI指令
void INTX_DISABLE(void);//关闭所有中断
void INTX_ENABLE(void);	//开启所有中断
void MSR_MSP(u32 addr);	//设置堆栈地址 

#endif /* __COMMON_H */
/***************************************************************************************
**  End Of File                                                     
***************************************************************************************/
